In [1]:
import pandas as pd

In [2]:
file = "pkl/uber-raw-data-combined.csv.pkl"
df = pd.read_pickle(file)
df

                  Date/Time      Lat      Lon    Base
0          4/1/2014 0:11:00  40.7690 -73.9549  B02512
1          4/1/2014 0:17:00  40.7267 -74.0345  B02512
2          4/1/2014 0:21:00  40.7316 -73.9873  B02512
3          4/1/2014 0:28:00  40.7588 -73.9776  B02512
4          4/1/2014 0:33:00  40.7594 -73.9722  B02512
...                     ...      ...      ...     ...
4534322  9/30/2014 22:57:00  40.7668 -73.9845  B02764
4534323  9/30/2014 22:57:00  40.6911 -74.1773  B02764
4534324  9/30/2014 22:58:00  40.8519 -73.9319  B02764
4534325  9/30/2014 22:58:00  40.7081 -74.0066  B02764
4534326  9/30/2014 22:58:00  40.7140 -73.9496  B02764

[4534327 rows x 4 columns]

In [17]:
def time_sampling(start, end):
    df["Date/Time"] = pd.to_datetime(df["Date/Time"])
    filter_df = df[(df["Date/Time"] >= start) & (df["Date/Time"] <= end)]
    sample_df = filter_df.sort_values(by="Date/Time")
    return sample_df

## Inputs go by:
"Year-Month-Day Hour:Minute:Second"

*time is in 24 hour clock

the rows are out of order because original csv was sorted by base values, not time.

In [20]:
time_sampling("2014-04-01 00:00:00", "2014-04-29 00:00:00")

                 Date/Time      Lat      Lon    Base
326800 2014-04-01 00:00:00  40.7215 -73.9952  B02682
35536  2014-04-01 00:00:00  40.7637 -73.9600  B02598
35537  2014-04-01 00:00:00  40.7188 -73.9863  B02598
218799 2014-04-01 00:01:00  40.7355 -73.9966  B02617
35538  2014-04-01 00:02:00  40.7444 -73.9964  B02598
...                    ...      ...      ...     ...
196800 2014-04-29 00:00:00  40.6449 -73.7822  B02598
532933 2014-04-29 00:00:00  40.6462 -73.7769  B02682
31863  2014-04-29 00:00:00  40.6448 -73.7825  B02512
532935 2014-04-29 00:00:00  40.7528 -73.9793  B02682
532934 2014-04-29 00:00:00  40.7049 -74.0077  B02682

[505435 rows x 4 columns]